from analysis import get_composition
from parts import Jumla


in_out = [
    ['فَعَولَن مَفَاعَيلَن فَعَولَن مَفَاعَلَن', [1, 1, 0, 1, 0,
                                                  1, 1, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 0]],
    ['ذُو العَقلِ يَشقَى فِي النَعِيمِ بِعَقلِهِي', [1, 0, 1, 0, 1, 1, 0, 1,
                                                     0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0]],
    ['قاضي المَدِينَة', [1, 0, 1, 0, 1, 1, 0, 1, 0]],
    ['لَو اتَّخَذتَ', [1, 1, 0, 1, 1, 0, 1]],
    ['شامِيَّةٌ', [1, 0, 1, 0, 1, 1, 0]],
    ['وَلَدًا وَلَداً وَلَدٌ وَلَدٍ', [1,1,1,0,1,1,1,0,1,1,1,0,1,1,1,0]]
]


def test():
    for _in, _out in in_out:
        assert (Jumla(_in).tone == _out)
