from analysis import get_composition
from parts import Jumla


in_out = [
    ['فَعَولَن مَفَاعَيلَن فَعَولَن مَفَاعَلَن', [1, 1, 0, 1, 0,
                                                  1, 1, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 0]],
    ['ذُو العَقلِ يَشقَى فِي النَعِيمِ بِعَقلِهِي', [1, 0, 1, 0, 1, 1, 0, 1,
                                                     0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0]],
    ['قاضي المَدِينَة', [1, 0, 1, 0, 1, 1, 0, 1, 0]],
    ['لَو اتَّخَذتَ', [1, 1, 0, 1, 1, 0, 1]],
    ['شامِيَّةٌ', [1, 0, 1, 0, 1, 1, 0]],
    ['وَلَدًا وَلَداً وَلَدٌ وَلَدٍ', [1,1,1,0,1,1,1,0,1,1,1,0,1,1,1,0]],
    ['أخَذَ الضَبعُ الفَريسَةَ إلى مَأواهُ', [1,1,1,0,1,0,1,0,1,1,0,1,1,1,1,0,1,0,1,0,1]],
    ['ذهَبَ الوَلَدُ حيثُ كانَ أبوهُ يرعى الإِبِلَ', [1,1,1,0,1,1,1,1,0,1,1,0,1,1,1,0,1,1,0,1,0,1,1,1]],

]


def test():
    for _in, expected in in_out:
        actual = Jumla(_in).tone
        assert (actual == expected), actual
test()